Enums/НапоминанияИнтервалыПереноса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>НапоминанияИнтервалыПереноса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минут5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минут15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минут30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завтра</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НапоминанияИнтервалыПереноса/Ext/ManagerModule.bsl
Функция ПолучитьВСекундах(Значение) Экспорт
	Если Значение = Перечисления.НапоминанияИнтервалыПереноса.ПустаяСсылка() Тогда
		Возврат 0;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Минут5 Тогда
		Возврат 5 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Минут15 Тогда
		Возврат 15 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Минут30 Тогда
		Возврат 30 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Час1 Тогда
		Возврат 60 * 60; 
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Час4 Тогда
		Возврат 4 * 60 * 60;
	ИначеЕсли Значение = Перечисления.НапоминанияИнтервалыПереноса.Завтра Тогда
		Возврат КонецДня(ТекущаяДата()) - ТекущаяДата() + 1;
	КонецЕсли;
КонецФункции
